Tekla Open API Reference for Tekla Structures 2025
ElementBase.IsEqual Method
 Compares the current object with the given object. Checks every field of both objects for equality.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool IsEqual(
	Object ObjectToCompare
)
Public MustOverride Function IsEqual (
	ObjectToCompare As Object
) As Boolean
Parameters
ObjectToCompare
Type: System.Object
An object of the same type to be used for comparing.
Return Value
Type: Boolean
True if the field values of both objects match.
Implements
IIsEqual.IsEqual(Object)
See Also
Reference
ElementBase Class
Tekla.Structures.Drawing Namespace